// Пусть дана переменная r с радиусом круга. 
// По соответствующей формуле найдите площадь круга и запишите ее в переменную s. 
// Выведите содержимое этой переменной на экран.
const r = 24;
const s = 3.14 * r ** 2;
console.log(s);


// Пусть дана переменная a со стороной квадрата. 
// Найдите площадь квадрата и запишите ее в переменную s1. 
// Выведите содержимое этой переменной на экран.
const a = 10;
const s1 = a * a;
console.log(s1);


// Пусть даны переменные a1 и b1 со сторонами прямоугольника. 
// Найдите площадь прямоугольника и запишите ее в переменную s2. 
// Выведите содержимое этой переменной на экран.
const a1 = 2, b1 = 3;
const s2 = a1 * b1;
console.log(s2);


// Пусть даны переменные a2 и b2 со сторонами прямоугольника. 
// Найдите периметр прямоугольника и запишите его в переменную p. 
// Выведите содержимое этой переменной на экран.
const a2 = 2, b2 = 3;
const p = a2 * 2 + b2 * 2;
console.log(p)


// Пусть дана переменная tc с температурой в градусах Цельсия. 
// По соответствующей формуле выполните перевод этой температуры в градусы Фаренгейта.
const tc = 30;
const ctc = (tc * 9/5) + 32;
console.log(ctc)


// Пусть дана переменная tf с температурой в градусах Фаренгейта. 
// По соответствующей формуле выполните перевод этой температуры в градусы Цельсия.
const tf = 485;
const ftf = (tf - 32) / 1.8;
console.log(ftf)