// Найдите количество секунд в сутках.
console.log(60 * 60 * 24)


// Найдите количество секунд в 30 сутках.
console.log(60 * 60 * 24 * 30)


// Найдите количество секунд в году.
console.log(60 * 60 * 24 * 365)


// Найдите количество минут в году.
console.log(60 * 24 * 365)


// Найдите количество байт в мегабайте.
console.log(1 * 1024 * 1024)


// Найдите количество байт в гигабайте.
console.log(1 * 1024 * 1024 * 1024)


// Найдите количество байт в 10 гигабайтах.
console.log(1 * 1024 * 1024 * (1024 * 10))


// Найдите количество байт в терабайте.
console.log(1 * 1024 * 1024 * 1024 * 1024)


// Найдите количество килобайт в терабайте.
console.log(1 * 1024 * 1024 * 1024)