// Создайте переменную a1. Запишите в нее сумму чисел 1, 2 и 3. 
// С помощью функции alert выведите на экран содержимое переменной a.
const a1 = 1 + 2 + 3;
// alert(a1);

// Создайте переменную a со значением 10 и переменную b со значением 2. 
// Выведите на экран их сумму, разность, произведение и частное (результат деления).
const a = 10;
const b = 2;
console.log(a + b);
console.log(a - b);
console.log(a * b);
console.log(a / b);


// Создайте переменную c1 со значением 10 и переменную d1 со значением 5. 
// Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.
const c1 = 10;
const d1 = 5;
const result = c1 + d1;
console.log(result);


// Создайте переменную a2 со значением 1, переменную b2 со значением 2 и переменную c2 со значением 3. 
// Выведите на экран их сумму.
const a2 = 1, b2 = 2, c2 = 3;
console.log(a2 + b2 + c2);


// Запишите в переменную a3 число 1.5, а в переменную b3 - число 0.75. 
// Найдите сумму значений этих переменных и выведите ее на экран.
const a3 = 1.5;
const b3 = 0.75;
console.log(a3 + b3);


// Найдите остаток от деления следующих переменных:
let a4 = 13;
let b4 = 5;
console.log(a4 % b4);


// Возведите число 2 в 10-ю степень. Выведите результат на экран.
console.log(2 ** 10);

