// С помощью цикла for выведите в консоль числа от 1 до 100.
for (let i = 1; i < 101; i++) {
  console.log(i);
}


// С помощью цикла for выведите в консоль числа от 11 до 33.
for (let i = 11; i < 34; i++) {
  console.log(i);
}


// С помощью цикла for выведите в консоль четные числа в промежутке от 0 до 100.
for (let i = 2; i < 101; i += 2) {
  console.log(i)
}


// С помощью цикла for выведите в консоль нечетные числа в промежутке от 1 до 99.
for (let i = 1; i < 100; i += 2) {
  console.log(i);
}


// С помощью цикла for выведите в консоль числа от 100 до 0.
for (let i = 100; i > 0; i--) {
  console.log(i);
}
