// Дан следующий массив:
// let arr = ['a', 'b', 'c'];
// Дана также переменная:
// let key = 2;
// Выведите на экран элемент, ключ которого хранится в переменной key.
let arr = ['a', 'b', 'c'];
let key = 2;
console.log(arr[key]);


// Дан следующий массив:
// let arr1 = [1, 2, 3, 4, 5];
// Даны также переменные:
// let key1 = 1;
// let key2 = 2;
// Найдите сумму элементов, ключи которых хранятся в наших переменных.
let arr1 = [1, 2, 3, 4, 5];
let key1 = 1;
let key2 = 2;
console.log(arr1[key1] + arr1[key2]);