// Выведите в консоль числа от 1 до 100.
let num1 = 1;
while (num1 < 101) {
  console.log(num1);
  num1++;
}


// Выведите в консоль числа от 11 до 33.
let num2 = 11;
while (num2 < 34) {
  console.log(num2);
  num2++;
}


// Дано число num с неким начальным значением. 
// Умножайте его на 3 столько раз, пока результат умножения не станет больше 1000. 
// Какое число получится? Посчитайте количество итераций, необходимых для этого.
let num3 = 3;
let counter;
while (num3 < 1000) {
  num3 * 3;
  counter++
}
console.log(counter)