// Создайте массив с элементами 'a', 'b', 'c'. 
// Запишите вместо первого элемента число 1, вместо второго - 2, вместо третьего - 3.
let arr = ['a', 'b', 'c'];
arr[0] = 1;
arr[1] = 2;
arr[2] = 3;


// Создайте массив с числами. 
// Прибавьте к каждому элементу массива число 3. 
// Выведите на экран измененный массив.
let arr1 = [2, 4, 6];
arr1[0] += 3;
arr1[1] += 3;
arr1[2] += 3;
console.log(arr1)


// Создайте массив с элементами 1, 2 и 3. 
// С помощью оператора ++ увеличьте каждый элемент массива на единицу.
let arr2 = [1, 2, 3];
arr2[0]++;
arr2[1]++;
arr2[2]++;
console.log(arr2);