// Проверьте, что переменная test больше 10.
let test = 11;
if (test > 10) {
  console.log("Переменная больше 10");
};


// Проверьте, что переменная test1 меньше 10.
let test1 = 9;
if (test1 < 10) {
  console.log("Переменная меньше 10");
};


// Проверьте, что переменная test2 больше или равна 10.
let test2 = 10;
if (test2 >= 10) {
  console.log("Переменная больше или равна 10");
};


// Проверьте, что переменная test3 меньше или равна 10.
let test3 = 6;
if (test3 <= 10) {
  console.log("Переменная меньше или равняется 10");
};