// Объявите переменную, не задавая ей значения. Выведите значение созданной переменной на экран.
let a;
console.log(a);


// Присвойте переменной значение null. Выведите эту переменную на экран.
let b = null;
console.log(b);


// Присвойте переменной значение true. Выведите эту переменную на экран.
let a1 = true;
console.log(a1);


//Присвойте переменной значение false. Выведите эту переменную на экран.
let b1 = false;
console.log(b1)


// Сделайте две строки. Перемножьте их друг на друга. Выведите результат умножения на экран.
const str1 = 'aaa';
const str2 = 'bbb';
console.log(str1 * str2)


//Поделите число 10 на 0. Выведите результат на экран.
console.log(10 / 0);


// Поделите число -10 на 0. Выведите результат на экран.
console.log(-10 / 0);